The  RebarShapeConstraintChordLength  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RebarShapeConstraint  .)
 See Also
  RebarShapeConstraintChordLength Class
  Autodesk.Revit.DB.Structure Namespace